# Formulae
brew "bat"
brew "btop"
brew "colima"
brew "direnv"
brew "docker"
brew "eza"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "jq"
brew "neovim"
brew "pre-commit"
brew "python"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tlrc"
brew "tmux"
brew "unzip"
brew "uv"
brew "worktrunk"
brew "yazi"
brew "zoxide"
brew "zsh"

# macOS only
if OS.mac?
  tap "nikitabobko/tap"
  cask "kitty"
  cask "nikitabobko/tap/aerospace"
end
